{"owner": "octocat", "repo": "git-consortium", "branch": "master", "data": [{"type": "Repository-Contents", "data": {"LICENSE": "The MIT License (MIT)\n\nCopyright (c) 2014 The Octocat\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.", "README.md": "git-consortium\n==============\n\nThis repository is meant to provide an example for editing lists in Markdown. For some more information on Markdown, [check out our guide, \"Markdown Basics\"][Markdown]. Thanks! :sparkling_heart:\n\n[Markdown]: https://help.github.com/articles/markdown-basics \"Markdown Basics\"\n", "product-backlog.md": "# Git Consortium Website Product Backlog\n\n### Profiles\n\n* As a site member, I want to describe myself on my own page in a semi-structured way. That is, I can fill in predefined fields, but also have room for a free-text field or two.\n  * It would be nice to let this free text be HTML or similar.\n* As a site member, I can fill out an application to become a Practitioner.\n* As a Practitioner, I want my profile page to include additional details about me.\n  * i.e., some of the answers to my Practitioner application.\n* As a site member, I can fill out an application to become a Trainer.\n* As a Trainer, I want my profile page to include additional details about me.\n  * i.e., some of the answers to my Trainer application.\n* As a Practitioner or Trainer, when I provide content to the site I want a small graphic associated with the content indicating I'm a Practitioner or Trainer.\n  * For example, Amazon's \"Top 500 Reviewers\" approach.\n* As a trainer, I want my profile to list my upcoming classes and include a link to a detailed page about each.\n* As a site member, I can view the profiles of other members.\n* As a site member, I can search for profiles based on a few fields:\n  * class attended\n  * location\n  * name\n* As a site member, I can mark my profile as private in which case only my name will appear.\n* As a site member, I can mark my email address as private even if the rest of my profile is not.\n* As a site member, I can send an email to any member via a form.\n* As a site administrator, I can read practicing or training applications and approve or reject them.\n* As a site administrator, I can edit any site member profile.\n\n### News\n\n* As a site a site editor, I can set the following dates on a news item:\n  * Start Publishing Date (the date an item becomes visible on the site (perhaps next Monday))\n  * Old News Date (the date it stops appearing on the home page)\n  * Stop Publishing Date (the date it is removed from the site, which may be never)\n* As a site member, I can subscribe to an RSS feed of news (and events? Or are they separate?).\n* As a site editor, I can assign priority numbers to news items. Items are displayed on the front page based on priority.\n\n###  Courses and Events\n\n* As a site visitor, I can see a list of all upcoming \"Certification Courses.\" I can page through them if there are a lot.\n* As a site visitor, I can see a list of all upcoming \"Other Courses\" (non-certification courses). I can page through them if necessary.\n* As a site visitor, I can see a list of all upcoming \"Events.\"\n  * Events are things such as the Git Summit, conferences, free seminars, etc.\n* As a trainer, I can create a new course or event. This includes the following information:\n  * name\n    * For a certification course the name of the class is a dropdown list\n    * for others, it is free text.\n  * description (HTML)\n  * trainer names (multiple selection from a list)\n  * start date\n  * end date\n  * venue name (HTML) and address\n  * contact name\n  * contact phone\n  * contact email\n  * a link for more information\n  * a link to register\n* As a trainer, when I create an Other Course or Event, I am charged a listing fee for that activity.\n  * Note: We'll need this to tie into credit card processing.\n* As a site administrator, I can create an Other Course (?) or Event that is not charged a listing fee. This is so that the Git Consortium doesn't charge itself for Git Summits that it puts on.\n* As a site administrator, I can set the listing fee per Other Course or Event.\n* As a trainer, I can update one of my existing courses or events.\n* As a trainer, I can delete one of my courses or events.\n* As a trainer, I can copy one of my courses or events so that I can create a new one. When copying it I am asked for the date(s) of the new course or event.\n* As a site admin, I can delete any course or event.\n* As a site editor, I can update any course or event.\n* As a trainer, admin, or editor, I can turn a course into an event or an event into a course (in case it was entered in the wrong category).\n  * Note: making something a Certification Course will probably require selecting the name of the course from the pre-approved list.\n* As a site visitor, I have an advanced search option that lets me fill in a form of search criteria\n  * country\n  * state\n  * trainer name\n  * date range\n  * word in description\n* As a site visitor, when I'm viewing a course I can click on the trainer's name and be taken to the trainer's profile.\n* As a site visitor, I can subscribe to an RSS feed of upcoming courses and events.\n\n### FAQs\n\n* As a site visitor, I can read FAQs.\n* As a site editor, I can maintain an FAQ section.\n* As a site member, I can do a full-text search of the FAQs. (Maybe we want this for any site visitor?)\n\n### Resource\n\n* As a site member, I can download the latest training material and methodology PDFs.\n* As a visitor, I can download presentations, PDFs, etc. on Git that I can use.\n\n### Jobs\n\n* As a site member (?), I can scroll through a listing of jobs. (There won't be enough at first to justify search fields.)\n* As someone who wants to hire, I can post a \"help wanted ad\".\n* As a site admin, I need to approve each help wanted ad before it gets to the site.\n* As a site admin, I am emailed whenever a job is submitted (so that I am aware of it and can decide if I want to post it).\n* As a site member, I can subscribe to an RSS feed of jobs available.\n* As a site admin, I can edit and delete help wanted ads.\n* As a site admin, I want jobs to stop publishing on the site 30 days after being posted.\n  * Note: 30 days doesn't need to be configurable at this point. Hardcoding is fine for now.\n* As someone who wants to hire, I want to be able to extend an ad for another 30 days (repeatedly) by visiting the site and updating the posting.\n  * Note, I can't update it 10 times today and extend the posting 300 days today.\n* As someone who has posted an ad that is about to expire, seven days before it expires I want to be emailed a reminder so that I can go extend the ad.\n  * Note: This means the ad could have an expiration date 37 days into the future, which is fine.\n\n### Articles\n\n* As a site visitor, I want to read a new article on the front page about once a week.\n* As the site editor, I can include a teaser with each article. The teaser shows up on the front page for all to read.\n* As a site member who has read a teaser on the front page, I want to read the entire article.\n  * Note: We want any site visitor to read articles for now.\n* As the site editor, I can add an article to the site.\n* As a site editor, I can set:\n  * start publishing dates (when teaser appears on front page)\n  * old article date (when it disappears from home page)\n  * stop publishing dates (when it's removed from site, if ever) for articles.\n* As a site editor, I want to be able to designate whether or not an article (or for that matter any piece of info) ever makes the home page... some things will not.\n* As the site editor, I have pretty good control over how the article looks.\n  * include images and captions, for example.\n* As a site visitor, I want the link from the article teaser to take me directly to the body of the article.\n  * not to another teaser setup.\n* As a site editor, I want to be able to indicate whether an article is publicly available or for members only.\n* As a site visitor, I want to be able to read some of your articles.\n* As a site member, I want to have full access to all articles.\n* As a site visitor, I can do a full-text search of article body, title, and author name.\n* As a site visitor, I can subscribe to an RSS feed of articles. (Teasers only?)\n* As a site visitor, I can post comments about articles so that others can read them.\n\n### Home Page\n\n* As a site editor, I want to have a prominent area on the home page where I can put special announcements, not necessarily news or articles.\n* As a site editor, I'd like to have some flexibility as to where things appear to accommodate different types of content.\n* As a site member, the upcoming courses are what I want visitors to notice.\n* As a site visitor, I want to see new content when I come to the site.\n* As a site visitor, I want to have articles that interest me and are easy to get to.\n* As a site editor, I have ideas on how I want the home page to look and feel.\n* As a site visitor, I need to know as soon as I visit what on earth Git is, and why it needs an consortium.\n* As a site visitor, I want to know as I glance around the home page what on earth a CSM is and why I'd want to be one.\n* As a site visitor, I want to be able to get back to the home page quickly and easily.\n\n### Ratings\n\n* As someone who successfully completed a Certification Course (becoming a Certified Git Leader or Certified Product Owner), I am emailed a link to a survey about the course and instructor.\n* As a trainer, I want to be assured that no one can submit the same answers multiple time and skew my results.\n* As a trainer, I am notified about the results of surveys about my classes. (Questions: After each survey? After a set period of time? Does the trainer get an email or just know to go to the site?)\n* As a site admin, I can see the results for each trainer and averages for the class (for all trainers).\n* As a site visitor who is considering attending a certification course, I want to see a trainer's rating (either for that course or for all of his or her certification courses combined).\n* As a trainer, I want my rating to show up on my profile page.\n* As a site visitor, I want to see a list of the most popular items on the site.\n  * Note: Not everything has to be considered:\n     * we don't need to know the most popular profile\n     * it would be useful to a have a \"most popular\" box that listed the most popular articles, news items, or etc.\n\n### What Is Git?\n\n* As a site visitor, I want there to be a section of the website that teaches me the basics of what Git is.\n* As a site editor, I can create the content of the What Is Git section.\n\n### Registry\n\n* As a site visitor, I can view lists on the site of all Certified Git Leaders, Practitioners, and Certified Product Owners.\n  * The CSM list has over 5,000 names so a letter-based pagination approach is needed.\n* As a CSM, Practitioner, or Certified Product Owner, I can have my name listed in the registry without becoming a member of the site.\n  * For example, I take a certification class but never register or let my membership lapse.\n* As a trainer who has finished teaching a Certification class, I can load an Excel file (first name, last name, email) into the site.\n  * I am prompted for:\n    * the trainer names (I may not have trained alone)\n    * certification date\n    * type of certification (i.e., CSM or CPO)\n  * The names are loaded into a pending state and not yet added to the registry.\n    * Note: We could have this charge $50 per person right then.\n* As a site admin, I can view all classes in a pending state.\n* As a site admin who has received proof of payment from a trainer, I can move people in his or her class from a pending state to the registry.\n* As a new Certified Git Leader or Certified Product Owner, once my name has been loaded to the registry I am sent an email welcoming me to the Git Consortium and containing instructions on how to register / activate my membership.\n* As a site editor, I can edit the content of the email automatically sent to new Certified Git Leaders and Product Owners.\n\n\n### Membership\n\n* As a company, I can join the Git Consortium by paying a corporate membership fee. This will include uploading items related to corporate membership\n  * e.g. company description\n  * e.g. a logo of size x by y.\n* As a corporate sponsor, my logo is displayed on a \"corporate sponsors\" page just like at http://www.agileconsortium.org/portal_url/corporatemembers.\n  * Note that the display order on that page is random.\n* As a corporate sponsor I want my logo to randomly appear on the home page.\n  * That is, it rotates among other corporate sponsors.\n* As a CSM or CPO who has been approved for Practitioner status (by a site admin reading my submission), I am charged a fee.\n* As someone about to become a trainer, I can pay an annual fee.\n* As a site administrator, I can set the annual fees for members, Practitioners and Trainers.\n* As someone whose membership (of any type) is about to expire, I am sent a reminder and a link through which I can renew.\n  * Note: Think about overlapping memberships and prorating.\n* As a member with short-term memory problems, I can have the system email me a new password or a password reminder, possibly my username (unless we use email for that), and so on.\n\n### For Trainers Only\n\n* As a trainer, I can read information of relevance only to trainers.\n* As a site editor, I can post information in a trainers-only section.\n\n---\n\nThis document is based on http://www.mountaingoatsoftware.com/agile/scrum/product-backlog/example/, used with the kind permission of Mike Cohn and Mountain Goat Software.\n"}}, {"type": "Repository-Detail", "data": "Repository Details:\n  Description: This repo is for demonstration purposes only.\n  Stars: 400\n  Forks: 109\n  Open Issues: 44\n  Watchers: 400\n\nBranches:\n  master\n"}, {"type": "Repository-Structure", "data": "|-- LICENSE\n|-- README.md\n|-- product-backlog.md"}, {"type": "File-Types", "data": {"LICENSE": 33.33333333333333, "md": 66.66666666666666}}]}